RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/include/cy_smif_memslot.h
/* ----------------------------  4th DWORD  ---------------------------- */
#define CY_SMIF_SFDP_1_1_2_DUMMY_CYCLES_Pos         (0UL)                   /**< The SFDP number of 1_1_2 fast read dummy cycles (Bit 0)               */
#define CY_SMIF_SFDP_1_1_2_DUMMY_CYCLES_Msk         (0x1FUL)                /**< The SFDP number of 1_1_2 fast read dummy cycles (Bitfield-Mask: 0x1F) */
#define CY_SMIF_SFDP_1_1_2_MODE_CYCLES_Pos          (5UL)                   /**< The SFDP number of 1_1_2 fast read mode cycles (Bit 5)                */
#define CY_SMIF_SFDP_1_1_2_MODE_CYCLES_Msk          (0xE0UL)                /**< The SFDP number of 1_1_2 fast read mode cycles (Bitfield-Mask: 0x07)  */
#define CY_SMIF_SFDP_1_2_2_DUMMY_CYCLES_Pos         (0UL)                   /**< The SFDP number of 1_2_2 fast read dummy cycles (Bit 0)               */
#define CY_SMIF_SFDP_1_2_2_DUMMY_CYCLES_Msk         (0x1FUL)                /**< The SFDP number of 1_2_2 fast read dummy cycles (Bitfield-Mask: 0x1F) */
#define CY_SMIF_SFDP_1_2_2_MODE_CYCLES_Pos          (5UL)                   /**< The SFDP number of 1_2_2 fast read mode cycles (Bit 5)                */
#define CY_SMIF_SFDP_1_2_2_MODE_CYCLES_Msk          (0xE0UL)                /**< The SFDP number of 1_2_2 fast read mode cycles (Bitfield-Mask: 0x07)  */

/* ----------------------------  10th DWORD  --------------------------- */
#define CY_SMIF_SFDP_ERASE_T1_COUNT_Pos             (4UL)                   /**< Erase Type 1 Erase, Typical time: count (Bits 8:4) */
#define CY_SMIF_SFDP_ERASE_T1_COUNT_Msk             (0x1F0UL)               /**< Erase Type 1 Erase, Typical time: count (Bitfield-Mask ) */
#define CY_SMIF_SFDP_ERASE_T1_UNITS_Pos             (9UL)                   /**< Erase Type 1 Erase, Typical time: units (Bits 10:9) */
#define CY_SMIF_SFDP_ERASE_T1_UNITS_Msk             (0x600UL)               /**< Erase Type 1 Erase, Typical time: units (Bitfield-Mask ) */
#define CY_SMIF_SFDP_ERASE_MUL_COUNT_Pos            (0UL)                   /**< Multiplier from typical erase time to maximum erase time (Bits 3:0) */
#define CY_SMIF_SFDP_ERASE_MUL_COUNT_Msk            (0x0FUL)                /**< Multiplier from typical erase time to maximum erase time (Bitfield-Mask ) */


/* ----------------------------  11th DWORD  --------------------------- */
#define CY_SMIF_SFDP_PAGE_SIZE_Pos                  (4UL)                   /**< The SFDP page size (Bit 4)                                    */
#define CY_SMIF_SFDP_PAGE_SIZE_Msk                  (0xF0UL)                /**< The SFDP page size (Bitfield-Mask: 0x0F)                      */
#define CY_SMIF_SFDP_PAGE_PROG_COUNT_Pos            (8UL)                   /**< The SFDP Chip Page Program Typical time: count (Bits 12:8)    */
#define CY_SMIF_SFDP_PAGE_PROG_COUNT_Msk            (0x1F00UL)              /**< The SFDP Chip Page Program Typical time: count (Bitfield-Mask)*/
#define CY_SMIF_SFDP_PAGE_PROG_UNITS_Pos            (13UL)                  /**< The SFDP Chip Page Program Typical time: units (Bit 13)       */
#define CY_SMIF_SFDP_PAGE_PROG_UNITS_Msk            (0x2000UL)              /**< The SFDP Chip Page Program Typical time: units (Bitfield-Mask)*/
#define CY_SMIF_SFDP_CHIP_ERASE_COUNT_Pos           (24UL)                  /**< The SFDP Chip Erase Typical time: count (Bits 28:24)          */
#define CY_SMIF_SFDP_CHIP_ERASE_COUNT_Msk           (0x1F000000UL)          /**< The SFDP Chip Erase Typical time: count (Bitfield-Mask)       */
#define CY_SMIF_SFDP_CHIP_ERASE_UNITS_Pos           (29UL)                  /**< The SFDP Chip Erase Typical time: units (Bits 29:30)          */
#define CY_SMIF_SFDP_CHIP_ERASE_UNITS_Msk           (0x60000000UL)          /**< The SFDP Chip Erase Typical time: units (Bitfield-Mask)       */
#define CY_SMIF_SFDP_PROG_MUL_COUNT_Pos             (0UL)                   /**< Multiplier from typical time to max time for Page or byte program (Bits 3:0)          */
#define CY_SMIF_SFDP_PROG_MUL_COUNT_Msk             (0x0FUL)                /**< Multiplier from typical time to max time for Page or byte program (Bitfield-Mask)       */

/* ----------------------------  15th DWORD  --------------------------- */
#define CY_SMIF_SFDP_QE_REQUIREMENTS_Pos            (4UL)                   /**< The SFDP quad enable requirements field (Bit 4)               */
#define CY_SMIF_SFDP_QE_REQUIREMENTS_Msk            (0x70UL)                /**< The SFDP quad enable requirements field (Bitfield-Mask: 0x07) */


/* ----------------------------  16th DWORD  --------------------------- */
#define CY_SMIF_SFDP_ENTER_4_BYTE_METHOD_B7 (1U)                            /**< Issue 0xB7 instruction */
#define CY_SMIF_SFDP_ENTER_4_BYTE_METHOD_WR_EN_B7 (2U)                      /**< Issue write enable instruction followed with 0xB7 */
#define CY_SMIF_SFDP_ENTER_4_BYTE_METHOD_ALWAYS_4_BYTE (0x40U)              /**< Memory always operates in 4-byte mode */
#define CY_SMIF_SFDP_ENTER_4_BYTE_METHOD_B7_CMD (0xB7U)                     /**< The instruction required to enter 4-byte addressing mode */

/* ----------------------------  17th DWORD  --------------------------- */
#define CY_SMIF_SFDP_FAST_READ_1_1_8_Pos            (0UL)                  /**< The SFDP 1-1-8 fast read support (Bitfield 24:31)               */
#define CY_SMIF_SFDP_FAST_READ_1_1_8_Msk            (0xFFUL)          /**< The SFDP 1-1-8 fast read support (Bitfield-Mask: 0xFF) */
#define CY_SMIF_SFDP_1_1_8_MODE_CYCLES_Pos          (5UL)                  /**< The SFDP number of 1-1-8 fast read mode cycles (Bitfield 21:23)                */
#define CY_SMIF_SFDP_1_1_8_MODE_CYCLES_Msk          (0xE0UL)            /**< The SFDP number of 1-1-8 fast read mode cycles (Bitfield-Mask: 0xE)  */
#define CY_SMIF_SFDP_1_1_8_DUMMY_CYCLES_Pos         (0UL)                  /**< The SFDP number of 1_1_8 fast read dummy cycles (Bit 16:19)               */
#define CY_SMIF_SFDP_1_1_8_DUMMY_CYCLES_Msk         (0x1FUL)            /**< The SFDP number of 1_1_8 fast read dummy cycles (Bitfield-Mask: 0x1F) */
#define CY_SMIF_SFDP_FAST_READ_1_8_8_Pos            (0UL)                   /**< The SFDP 1-8-8 fast read support (Bitfield 8:15)               */
#define CY_SMIF_SFDP_FAST_READ_1_8_8_Msk            (0xFFUL)              /**< The SFDP 1-8-8 fast read support (Bitfield-Mask: 0xFF) */
#define CY_SMIF_SFDP_1_8_8_MODE_CYCLES_Pos          (5UL)                   /**< The SFDP number of 1-8-8 fast read mode cycles (Bitfield 5:7)                */
#define CY_SMIF_SFDP_1_8_8_MODE_CYCLES_Msk          (0xE0UL)                /**< The SFDP number of 1-8-8 fast read mode cycles (Bitfield-Mask: 0xE)  */
#define CY_SMIF_SFDP_1_8_8_DUMMY_CYCLES_Pos         (0UL)                   /**< The SFDP number of 1_8_8 fast read dummy cycles (Bit 0:4)               */
#define CY_SMIF_SFDP_1_8_8_DUMMY_CYCLES_Msk         (0x1FUL)                 /**< The SFDP number of 1_8_8 fast read dummy cycles (Bitfield-Mask: 0x1F) */

/* ----------------------------  19th DWORD  --------------------------- */
#define CY_SMIF_SFDP_OCTAL_ENABE_BIT_Pos            (20UL)                  /**< Octal Enable bit present in the flash or not (Bitfiled 20:22)*/
#define CY_SMIF_SFDP_OCTAL_ENABE_BIT_Msk            (0x700000)              /**< Octal Enable bit present Mask (Bitfiled-Mask 0x7)*/

/* ---------------------------- xSPI Profile 1.0 ------------------------ */
#define XSPI_PROFILE_1_TABLE_BYTE_0        (0U)           /**< Byte 0x00 of the JEDEC xSPI Profile 1.0 */
#define XSPI_PROFILE_1_TABLE_BYTE_1        (1U)           /**< Byte 0x01 of the JEDEC xSPI Profile 1.0 */
#define XSPI_PROFILE_1_TABLE_BYTE_16       (0x10U)        /**< DWORD 5 => Byte 16 of the JEDEC xSPI Profile 1.0 */

/* ----------------------------  1st DWORD  --------------------------- */
#define CY_SMIF_SFDP_OCTAL_DDR_READ_CMD_Pos         (0UL)                  /**< Octal DDR 8D-8D-8D read command support position (Bitfield 8:15) */
#define CY_SMIF_SFDP_OCTAL_DDR_READ_CMD_Msk         (0xFFUL)               /**< Octal DDR 8D-8D-8D read command support Mask Bitfield-Mask: 0xFF00) */
#define CY_SMIF_SFDP_ODDR_166MHZ_DUMMY_CYCLES_Pos   (27UL)                 /**< Octal DDR 8D-8D-8D dummy cycles for 166 Mhz (Bitfield 27:31) */
#define CY_SMIF_SFDP_ODDR_166MHZ_DUMMY_CYCLES_Msk   (0xF8000000UL)         /**< Octal DDR 8D-8D-8D dummy cycles for 166 Mhz Mask */
#define CY_SMIF_SFDP_ODDR_200MHZ_DUMMY_CYCLES_Pos   (7UL)                  /**< Octal DDR 8D-8D-8D dummy cycles for 200 Mhz (Bitfield 7:11) */
#define CY_SMIF_SFDP_ODDR_200MHZ_DUMMY_CYCLES_Msk   (0xF80UL)               /**< Octal DDR 8D-8D-8D dummy cycles for 200 Mhz Mask */

/* ---------------------------- Command Sequence to Change to Octal DDR ------------------------ */
#define CMD_SEQ_OCTAL_DDR_CMD1_LEN_BYTE_OFFSET      (3U)                   /**< Octal DDR enable command 1 sequence length byte offset */
#define CMD_SEQ_OCTAL_DDR_CMD2_LEN_BYTE_OFFSET      (11U)                  /**< Octal DDR enable command 1 sequence length byte offset */
#define CY_SMIF_SFDP_ODDR_CMD_SEQ_MAX_LEN           (8U)                   /**< Octal DDR enable command sequence maximum length */

/** \cond INTERNAL */
/*******************************************************************************
* These are legacy constants and API. They are left here just
* for backward compatibility.
* Do not use them in new designs.
*******************************************************************************/

#define CY_SMIF_FLAG_WR_EN                          CY_SMIF_FLAG_WRITE_ENABLE
#define CY_SMIF_FLAG_CRYPTO_EN                      CY_SMIF_FLAG_CRYPTO_ENABLE
#define CY_SMIF_SFDP_SING_BYTE_00                   CY_SMIF_SFDP_SIGNATURE_BYTE_00
#define CY_SMIF_SFDP_SING_BYTE_01                   CY_SMIF_SFDP_SIGNATURE_BYTE_01
#define CY_SMIF_SFDP_SING_BYTE_02                   CY_SMIF_SFDP_SIGNATURE_BYTE_02
#define CY_SMIF_SFDP_SING_BYTE_03                   CY_SMIF_SFDP_SIGNATURE_BYTE_03
#define CY_SMIF_WR_STS_REG1_CMD                     CY_SMIF_WRITE_STATUS_REG1_CMD
#define CY_SMIF_WR_DISABLE_CMD                      CY_SMIF_WRITE_DISABLE_CMD
#define CY_SMIF_RD_STS_REG1_CMD                     CY_SMIF_READ_STATUS_REG1_CMD
#define CY_SMIF_WR_ENABLE_CMD                       CY_SMIF_WRITE_ENABLE_CMD
#define CY_SMIF_RD_STS_REG2_T1_CMD                  CY_SMIF_READ_STATUS_REG2_T1_CMD
#define CY_SMIF_WR_STS_REG2_CMD                     CY_SMIF_WRITE_STATUS_REG2_CMD
#define CY_SMIF_RD_STS_REG2_T2_CMD                  CY_SMIF_READ_STATUS_REG2_T2_CMD
#define CY_SMIF_QE_BIT_STS_REG2_T1                  CY_SMIF_QE_BIT_STATUS_REG2_T1
#define CY_SMIF_STS_REG_BUSY_MASK                   CY_SMIF_STATUS_REG_BUSY_MASK

#define Cy_SMIF_Memslot_Init                        Cy_SMIF_MemInit
#define Cy_SMIF_Memslot_DeInit                      Cy_SMIF_MemDeInit
#define Cy_SMIF_Memslot_CmdWriteEnable              Cy_SMIF_MemCmdWriteEnable
#define Cy_SMIF_Memslot_CmdWriteDisable             Cy_SMIF_MemCmdWriteDisable
#define Cy_SMIF_Memslot_IsBusy                      Cy_SMIF_MemIsBusy
#define Cy_SMIF_Memslot_QuadEnable                  Cy_SMIF_MemQuadEnable
#define Cy_SMIF_Memslot_CmdReadSts                  Cy_SMIF_MemCmdReadStatus
#define Cy_SMIF_Memslot_CmdWriteSts                 Cy_SMIF_MemCmdWriteStatus
#define Cy_SMIF_Memslot_CmdChipErase                Cy_SMIF_MemCmdChipErase
#define Cy_SMIF_Memslot_CmdSectorErase              Cy_SMIF_MemCmdSectorErase
#define Cy_SMIF_Memslot_SfdpDetect                  Cy_SMIF_MemSfdpDetect
#define Cy_SMIF_Memslot_CmdProgram                  Cy_SMIF_MemCmdProgram
#define Cy_SMIF_Memslot_CmdRead                     Cy_SMIF_MemCmdRead

#define PARAM_ID_MSB_OFFSET                         (0x08U)  /* The offset of Parameter ID MSB */
#define PARAM_ID_LSB_MASK                           (0xFFUL) /* The mask of Parameter ID LSB */
#define MEM_ADDR_VALID(addr, size) (0U == ((addr)%(size)))  /* This address must be a multiple of
                                                             * the SMIF XIP memory size
                                                             */
#define MEM_MAPPED_SIZE_VALID(size) (((size) >= 0x10000U) && (0U == ((size)&((size)-1U))) )
#define MEM_ADDR_SIZE_VALID(addrSize)  ((0U < (addrSize)) && ((addrSize) <= CY_SMIF_FOUR_BYTES_ADDR))

/** \endcond */
/** \} group_smif_macros_sfdp */


/**
* \addtogroup group_smif_data_structures_memslot
* \{
*/

/** This command structure is used to store the Read/Write command
 * configuration. */
typedef struct
{
    uint32_t command;                       /**< The 8-bit command. This value is 0xFFFFFFFF when there is no command present */
    cy_en_smif_txfr_width_t cmdWidth;       /**< The width of the command transfer */
    cy_en_smif_txfr_width_t addrWidth;      /**< The width of the address transfer */
    uint32_t mode;                          /**< The 8-bit mode byte. This value is 0xFFFFFFFF when there is no mode present */
    cy_en_smif_txfr_width_t modeWidth;      /**< The width of the mode transfer */
    uint32_t dummyCycles;                   /**< The number of the dummy cycles. A zero value suggests no dummy cycles */
    cy_en_smif_txfr_width_t dataWidth;      /**< The width of the data transfer */
#if (CY_IP_MXSMIF_VERSION>=2) || defined (CY_DOXYGEN)
    /**
    * \note
    * This parameter is available for CAT1B, CAT1C and CAT1D devices.
    **/
    cy_en_smif_data_rate_t dataRate;           /**< The Data rate of data */
    /**
    * \note
    * This parameter is available for CAT1B, CAT1C and CAT1D devices.
    **/
    cy_en_smif_field_presence_t dummyCyclesPresence;   /**< This specifies the presence of the dummy field */
    /**
    * \note
    * This parameter is available for CAT1B, CAT1C and CAT1D devices.
    **/
    cy_en_smif_field_presence_t modePresence;  /**< This specifies the presence of the mode field */
    /**
    * \note
    * This parameter is available for CAT1B, CAT1C and CAT1D devices.
    **/
    uint32_t modeH;                            /**< The 8-bit command. This value is 0x0 when there is no higher byte mode present */
    /**
    * \note
    * This parameter is available for CAT1B, CAT1C and CAT1D devices.
    **/
    cy_en_smif_data_rate_t modeRate;           /**< The Data rate of mode */
    /**
    * \note
    * This parameter is available for CAT1B, CAT1C and CAT1D devices.
    **/
    cy_en_smif_data_rate_t addrRate;           /**< The Data rate of address */
    /**
    * \note
    * This parameter is available for CAT1B, CAT1C and CAT1D devices.
    **/
    cy_en_smif_field_presence_t cmdPresence;   /**< This specifies the presence of the command field */
    /**
    * \note
    * This parameter is available for CAT1B, CAT1C and CAT1D devices.
    **/
    uint32_t commandH;                         /**< The 8-bit command. This value is 0x0 when there is no higher byte command present */
    /**
    * \note
    * This parameter is available for CAT1B, CAT1C and CAT1D devices.
    **/
    cy_en_smif_data_rate_t cmdRate;            /**< The Data rate of command */
#endif /* CY_IP_MXSMIF_VERSION */
} cy_stc_smif_mem_cmd_t;

/** This structure specifies data used for memory with hybrid sectors */
typedef struct
{
    uint32_t regionAddress;                 /**< This specifies the address where a region starts */
    uint32_t sectorsCount;                  /**< This specifies the number of sectors in the region */
    uint32_t eraseCmd;                      /**< This specifies the region specific erase instruction */
    uint32_t eraseSize;                     /**< This specifies the size of one sector */
    uint32_t eraseTime;                     /**< Max time for sector erase type 1 cycle time in ms */
} cy_stc_smif_hybrid_region_info_t;

#if(CY_IP_MXSMIF_VERSION>=2)
/** This structure specifies data used for memory with hybrid sectors */
typedef struct
{
    uint8_t cmdSeq1Len;                                   /**< This specifies command sequence 1 length. */
    uint8_t cmdSeq2Len;                                   /**< This specifies command sequence 2 length. */
    uint8_t cmdSeq1[CY_SMIF_SFDP_ODDR_CMD_SEQ_MAX_LEN];   /**< This specifies command sequence 1. */
    uint8_t cmdSeq2[CY_SMIF_SFDP_ODDR_CMD_SEQ_MAX_LEN];   /**< This specifies command sequence 2. */
} cy_stc_smif_octal_ddr_en_seq_t;
#endif

/**
*
* This configuration structure of the SMIF memory device is used to store
* device-specific parameters.
* These parameters are used to set up the memory mode initialization and the
* memory API.
*/
typedef struct
{
    uint32_t numOfAddrBytes;                              /**< This specifies the number of address bytes used by the
                                                          * memory slave device, valid values 1-4 */
    uint32_t memSize;                                     /**< The memory size: For densities of 2 gigabits or less - the size in bytes;
                                                          * For densities 4 gigabits and above - bit-31 is set to 1b to define that
                                                          * this memory is 4 gigabits and above; and other 30:0 bits define N where
                                                          * the density is computed as 2^N bytes.
                                                          * For example, 0x80000021 corresponds to 2^30 = 1 gigabyte.
                                                          */
    cy_stc_smif_mem_cmd_t* readCmd;                       /**< This specifies the Read command */
    cy_stc_smif_mem_cmd_t* writeEnCmd;                    /**< This specifies the Write Enable command */
    cy_stc_smif_mem_cmd_t* writeDisCmd;                   /**< This specifies the Write Disable command */
    cy_stc_smif_mem_cmd_t* eraseCmd;                      /**< This specifies the Erase command */
    uint32_t eraseSize;                                   /**< This specifies the sector size of each Erase */
    cy_stc_smif_mem_cmd_t* chipEraseCmd;                  /**< This specifies the Chip Erase command */
    cy_stc_smif_mem_cmd_t* programCmd;                    /**< This specifies the Program command */
    uint32_t programSize;                                 /**< This specifies the page size for programming */
    cy_stc_smif_mem_cmd_t* readStsRegWipCmd;              /**< This specifies the command to read the WIP-containing status register  */
    cy_stc_smif_mem_cmd_t* readStsRegQeCmd;               /**< This specifies the command to read the QE-containing status register */
    cy_stc_smif_mem_cmd_t* writeStsRegQeCmd;              /**< This specifies the command to write into the QE-containing status register */
    cy_stc_smif_mem_cmd_t* readSfdpCmd;                   /**< This specifies the read SFDP command */
    uint32_t stsRegBusyMask;                              /**< The Busy mask for the status registers */
    uint32_t stsRegQuadEnableMask;                        /**< The QE mask for the status registers */
    uint32_t eraseTime;                                   /**< Max time for erase type 1 cycle time in ms */
    uint32_t chipEraseTime;                               /**< Max time for chip erase cycle time in ms */
    uint32_t programTime;                                 /**< Max time for page program cycle time in us */
    uint32_t hybridRegionCount;                           /**< This specifies the number of regions for memory with hybrid sectors */
    cy_stc_smif_hybrid_region_info_t** hybridRegionInfo;  /**< This specifies data for memory with hybrid sectors */
    cy_stc_smif_mem_cmd_t* readLatencyCmd;                   /**< This specifies the command to read variable latency cycles configuration register */
    cy_stc_smif_mem_cmd_t* writeLatencyCmd;               /**< This specifies the command to write variable latency cycles configuration register */
    uint32_t latencyCyclesRegAddr;                        /**< This specifies the address for variable latency cycle address */
    uint32_t latencyCyclesMask;                           /**< This specifies variable latency cycles Mask */
#if(CY_IP_MXSMIF_VERSION>=2)
    cy_stc_smif_octal_ddr_en_seq_t* octalDDREnableSeq;    /**< This specifies data for memory with hybrid sectors */
    cy_stc_smif_mem_cmd_t* readStsRegOeCmd;               /**< This specifies the command to read the OE-containing status register */
    cy_stc_smif_mem_cmd_t* writeStsRegOeCmd;              /**< This specifies the command to write into the OE-containing status register */
    uint32_t stsRegOctalEnableMask;                       /**< The QE mask for the status registers */
    uint32_t octalEnableRegAddr;                          /**< Octal enable register address */
    cy_en_smif_interface_freq_t freq_of_operation;        /**< Frequency of operation used in Octal mode */
#endif
} cy_stc_smif_mem_device_cfg_t;


/**
*
* This SMIF memory configuration structure is used to store the memory configuration for the memory mode of operation.
* This data structure is stored in a fixed location in the flash. The data structure is required
* for the initialization of the SMIF in the SystemInit.
*/
typedef struct
{
    /** Determines the slave select where the memory device is placed */
    cy_en_smif_slave_select_t slaveSelect;
    /** Determines if the device is memory-mapped, enables the Autodetect
     * using the SFDP, enables the write capability, or enables the crypto
     * support for this memory slave */
    uint32_t flags;
    /** The data-line selection options for a slave device */
    cy_en_smif_data_select_t dataSelect;
    /** The base address the memory slave is mapped to in the PSoC memory map.
     * This address must be a multiple of the SMIF XIP memory size/capacity. The
     * SMIF XIP memory region should NOT overlap with other memory regions
     * (with exception to dual quad mode). Valid when the memory-mapped mode is
     * enabled.
     */
    uint32_t baseAddress;
    /** The size/capacity allocated in the PSoC memory map for the memory slave
     * device. The capacity is allocated from the base address. The capacity
     * must be a power of 2 and greater or equal than 64 KB. Valid when
     * memory-mapped mode is enabled
     */
    uint32_t memMappedSize;
    /** Defines if this memory device is one of the devices in the dual quad SPI
     * configuration. Equals the sum of the slave-slot numbers.  */
    uint32_t dualQuadSlots;
    cy_stc_smif_mem_device_cfg_t* deviceCfg;   /**< The configuration of the device */
#if(CY_IP_MXSMIF_VERSION>=2)
    /** Continous transfer merge timeout.
     * After this period the memory device is deselected. A later transfer, even from a
     * continuous address, starts with the overhead phases (command, address, mode, dummy cycles).
     * This configuration parameter is available for CAT1B, CAT1C and CAT1D devices. */
    cy_en_smif_merge_timeout_t mergeTimeout;
#endif /* CY_IP_MXSMIF_VERSION */

