RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/include/cy_smif_memslot.h
        SMIF_DEVICE_RD_DUMMY_CTL(dev) = (0UL != read->dummyCycles)?
                                        (_VAL2FLD(SMIF_DEVICE_RD_DUMMY_CTL_SIZE5, (read->dummyCycles - 1UL)) |
                                        SMIF_DEVICE_RD_DUMMY_CTL_PRESENT_Msk)
                                        : 0U;

        SMIF_DEVICE_RD_DATA_CTL(dev) = _VAL2FLD(SMIF_DEVICE_RD_DATA_CTL_WIDTH, (uint32_t)read->dataWidth);
    }

    if(NULL != prog)
    {
        SMIF_DEVICE_WR_CMD_CTL(dev) = (CY_SMIF_NO_COMMAND_OR_MODE != prog->command) ?
                                    (_VAL2FLD(SMIF_DEVICE_WR_CMD_CTL_CODE,    (uint32_t)prog->command) |
                                    _VAL2FLD(SMIF_DEVICE_WR_CMD_CTL_WIDTH, (uint32_t)prog->cmdWidth)|
                                    SMIF_DEVICE_WR_CMD_CTL_PRESENT_Msk)
                                    : 0U;

        SMIF_DEVICE_WR_ADDR_CTL(dev) = _VAL2FLD(SMIF_DEVICE_WR_ADDR_CTL_WIDTH, (uint32_t)prog->addrWidth);

        SMIF_DEVICE_WR_MODE_CTL(dev) = (CY_SMIF_NO_COMMAND_OR_MODE != prog->mode) ?
                                        (_VAL2FLD(SMIF_DEVICE_WR_CMD_CTL_CODE,    (uint32_t)prog->mode)      |
                                        _VAL2FLD(SMIF_DEVICE_WR_CMD_CTL_WIDTH, (uint32_t)prog->modeWidth)|
                                        SMIF_DEVICE_WR_CMD_CTL_PRESENT_Msk)
                                        : 0UL;

        SMIF_DEVICE_WR_DUMMY_CTL(dev) = (0UL != prog->dummyCycles) ?
                                        (_VAL2FLD(SMIF_DEVICE_WR_DUMMY_CTL_SIZE5, (prog->dummyCycles - 1UL)) |
                                        SMIF_DEVICE_WR_DUMMY_CTL_PRESENT_Msk)
                                        : 0U;

        SMIF_DEVICE_WR_DATA_CTL(dev) = _VAL2FLD(SMIF_DEVICE_WR_DATA_CTL_WIDTH, (uint32_t)prog->dataWidth);
    }
#endif /* CY_IP_MXSMIF_VERSION */
}
/*******************************************************************************
* Function Name: ReadAnyReg
****************************************************************************//**
*
* This function reads any registers by address. This function is a blocking
* function, it will block the execution flow until the status register is read.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param slaveSelect
* The slave select line for the device.
*
* \param value
* The value of the register.
*
* \param command
* The command required to read the status/configuration register.
*
* \param dummyCycles
* Number of latency cycles to be issue after sending register address.
*
* \param address
* The register address array.
*
* \param addressSize
* The size of the address array.
*
* \param context
* This is the pointer to the context structure \ref cy_stc_smif_context_t
* allocated by the user. The structure is used during the SMIF
* operation for internal configuration and data retention. The user must not
* modify anything in this structure.
*
* \return A status of the command reception.
*        - \ref CY_SMIF_SUCCESS
*        - \ref CY_SMIF_CMD_FIFO_FULL
*        - \ref CY_SMIF_EXCEED_TIMEOUT
*        - \ref CY_SMIF_CMD_NOT_FOUND
*
*******************************************************************************/
__STATIC_INLINE cy_en_smif_status_t ReadAnyReg(SMIF_Type *base,
                                    cy_en_smif_slave_select_t  slaveSelect,
                                    uint8_t *value,
                                    uint8_t command,
                                    uint8_t dummyCycles,
                                    uint8_t const *address,
                                    uint32_t addressSize,
                                    cy_stc_smif_context_t const *context)
{
    cy_en_smif_status_t result = CY_SMIF_CMD_NOT_FOUND;

    /* Read the memory register */
    result = Cy_SMIF_TransmitCommand(base, command, CY_SMIF_WIDTH_SINGLE,
                address, addressSize,
                CY_SMIF_WIDTH_SINGLE, slaveSelect,
                CY_SMIF_TX_NOT_LAST_BYTE, context);

    if ((CY_SMIF_SUCCESS == result) && (dummyCycles != 0U))
    {
        result = Cy_SMIF_SendDummyCycles(base, dummyCycles);
    }

    if (CY_SMIF_SUCCESS == result)
    {
        result = Cy_SMIF_ReceiveDataBlocking( base, value,
                    CY_SMIF_READ_ONE_BYTE, CY_SMIF_WIDTH_SINGLE, context);
    }

    return(result);
}
/*******************************************************************************
* Function Name: ValueToByteArray
****************************************************************************//**
*
* Unpacks 0-numBytes from a 4-byte value into the byte array byteArray.
*
* \param value
*  The 4-byte value to unpack.
*
* \param byteArray
* The byte array to fill.
*
* \param startPos
* The start position of the array to begin filling from.
*
* \param size
* The size of the array.
*
*
*******************************************************************************/
static void ValueToByteArray(uint32_t value, uint8_t *byteArray, uint32_t startPos, uint32_t size)
{
    do
    {
        size--;
        byteArray[size + startPos] = (uint8_t)(value & PARAM_ID_LSB_MASK);
        value >>= PARAM_ID_MSB_OFFSET; /* Shift to get the next byte */
    } while (size > 0U);
}


/*******************************************************************************
* Function Name: ByteArrayToValue
****************************************************************************//**
*
* Packs the byte array into a single value.
*
* \param byteArray
* The byte array to unpack.
*
* \param size
* The size of the array.
*
* \return
* The 4-byte value filled from the array.
*
*
*******************************************************************************/
static uint32_t ByteArrayToValue(uint8_t const *byteArray, uint32_t size)
{
    uint32_t value = 0UL;
    uint32_t idx = 0UL;
    for (idx = 0UL; idx < size; idx++)
    {
        value <<= 8;
        value |= ((uint32_t) byteArray[idx]);
    }
    return value;
}

#if defined(__cplusplus)
}
#endif

#endif /* CY_IP_MXSMIF */

#endif /* (CY_SMIF_MEMORYSLOT_H) */


/* [] END OF FILE */
